{
    "American": {
      "description": "American cuisine reflects the history and diversity of the United States, featuring a wide range of influences from various immigrant cultures. Common ingredients include beef, potatoes, corn, and poultry, with dishes such as hamburgers, hot dogs, apple pie, and barbecue ribs being iconic American favorites."
    },
    "Georgian": {
      "description": "Georgian cuisine is renowned for its bold flavors and unique spices. Traditional dishes often feature ingredients like walnuts, pomegranates, and aromatic herbs. Some popular Georgian dishes include khachapuri (cheese-filled bread), khinkali (dumplings), and various types of stews and grilled meats."
    },
    "German": {
      "description": "German cuisine is known for its hearty and comforting dishes, often featuring meats, potatoes, and bread. Sausages, such as bratwurst and currywurst, are popular, as well as dishes like schnitzel, sauerkraut, and pretzels. German cuisine varies by region, with each area offering its own specialties."
    },
    "Indian": {
      "description": "Indian cuisine is characterized by its rich and diverse flavors, as well as its use of aromatic spices and herbs. Curries, rice dishes, and breads like naan are staples of Indian cooking. Vegetarian options are prevalent, but meat dishes, such as tandoori chicken and lamb curry, are also popular."
    },
    "Italian": {
      "description": "Italian cuisine is celebrated for its simplicity and use of fresh, quality ingredients. Pasta, pizza, and risotto are staples, often accompanied by sauces made from tomatoes, olive oil, and herbs. Italian cuisine varies by region, with dishes like lasagna, gelato, and tiramisu representing the country's culinary diversity."
    },
    "Japanese": {
      "description": "Japanese cuisine emphasizes the natural flavors of ingredients and the art of presentation. Sushi, sashimi, and ramen are internationally recognized Japanese dishes, along with tempura, teriyaki, and miso soup. Japanese cuisine also includes a wide variety of seafood, rice dishes, and pickled vegetables."
    },
    "Polish": {
      "description": "Polish cuisine is hearty and comforting, with dishes often featuring meats, potatoes, and cabbage. Pierogi (dumplings), kielbasa (sausage), and bigos (hunter's stew) are popular Polish dishes. Traditional Polish cuisine also includes soups, breads, and pastries, with a focus on seasonal ingredients."
    },
    "Spanish": {
      "description": "Spanish cuisine is known for its vibrant flavors and use of fresh, locally sourced ingredients. Tapas, paella, and gazpacho are iconic Spanish dishes, along with chorizo, tortilla española, and churros. Spanish cuisine varies by region, reflecting the diverse cultural influences found throughout the country."
    },
    "Ukrainian": {
      "description": "Ukrainian cuisine is hearty and soulful, featuring dishes that are both comforting and flavorful. Borscht (beet soup), varenyky (filled dumplings), and holubtsi (cabbage rolls) are staples of Ukrainian cooking. Sour cream, dill, and garlic are common ingredients used to enhance the flavors of traditional Ukrainian dishes."
    }
  }
  