{
    "recipes": [
      {
        "id": 1,
        "name": "Chicken Tikka Masala",
        "cuisine": "Indian",
        "photoPath": "../recipes_photo/chicken_tikka_masala.jpeg",
        "ingredients": [
          "1 lb boneless, skinless chicken breasts, cut into bite-sized pieces",
          "1 cup plain yogurt",
          "2 tablespoons lemon juice",
          "2 teaspoons ground cumin",
          "2 teaspoons paprika",
          "2 teaspoons ground coriander",
          "1 teaspoon ground turmeric",
          "1 teaspoon garam masala",
          "1/2 teaspoon cayenne pepper",
          "Salt and pepper to taste",
          "2 tablespoons vegetable oil",
          "1 onion, finely chopped",
          "4 cloves garlic, minced",
          "1 tablespoon grated fresh ginger",
          "1 can (14 oz) crushed tomatoes",
          "1 cup heavy cream",
          "Chopped fresh cilantro for garnish"
        ],
        "instructions": [
          "In a bowl, combine yogurt, lemon juice, cumin, paprika, coriander, turmeric, garam masala, cayenne pepper, salt, and pepper.",
          "Add chicken pieces and marinate for at least 1 hour, or overnight for best flavor.",
          "Heat vegetable oil in a skillet over medium heat.",
          "Add onion, garlic, and ginger. Sauté until softened and fragrant.",
          "Add marinated chicken and cook until browned on all sides.",
          "Stir in crushed tomatoes and simmer for 15-20 minutes, until chicken is cooked through and sauce has thickened.",
          "Stir in heavy cream and simmer for an additional 5 minutes.",
          "Garnish with chopped cilantro before serving.",
          "Serve hot with rice or naan bread."
        ],
        "description": "Chicken Tikka Masala is a popular Indian dish featuring tender pieces of chicken marinated in a spiced yogurt sauce, then cooked in a rich and creamy tomato-based sauce. The marinade infuses the chicken with vibrant flavors of cumin, paprika, coriander, turmeric, garam masala, and cayenne pepper. The chicken is then simmered in a luscious sauce made with onions, garlic, ginger, crushed tomatoes, and heavy cream. Garnished with fresh cilantro, this dish is a favorite in Indian cuisine, celebrated for its bold flavors and comforting appeal."
      },
      {
        "id": 2,
        "name": "Vegetable Biryani",
        "cuisine": "Indian",
        "photoPath": "../recipes_photo/vegetable_biryani.jpeg",
        "ingredients": [
          "2 cups basmati rice, rinsed and drained",
          "4 cups water",
          "2 tablespoons vegetable oil",
          "1 onion, thinly sliced",
          "2 cloves garlic, minced",
          "1 tablespoon grated fresh ginger",
          "2 green chilies, sliced",
          "2 carrots, diced",
          "1 potato, diced",
          "1 cup cauliflower florets",
          "1 cup green peas",
          "1/4 cup plain yogurt",
          "1 teaspoon ground cumin",
          "1 teaspoon ground coriander",
          "1/2 teaspoon turmeric",
          "1/2 teaspoon garam masala",
          "Salt to taste",
          "Chopped fresh cilantro and mint for garnish"
        ],
        "instructions": [
          "In a large pot, bring water to a boil.",
          "Add rice and cook until partially cooked, about 5 minutes. Drain and set aside.",
          "Heat vegetable oil in a skillet over medium heat.",
          "Add onion, garlic, ginger, and green chilies. Sauté until onions are translucent.",
          "Add carrots, potato, cauliflower, and peas. Cook for 5-7 minutes, until vegetables are slightly tender.",
          "Stir in yogurt, cumin, coriander, turmeric, garam masala, and salt.",
          "Layer partially cooked rice and vegetable mixture in the pot.",
          "Cover and cook over low heat for 20-25 minutes, until rice is fully cooked and vegetables are tender.",
          "Garnish with chopped cilantro and mint before serving.",
          "Serve hot with raita or yogurt sauce."
        ],
        "description": "Vegetable Biryani is a fragrant and flavorful Indian rice dish made with basmati rice, mixed vegetables, and a blend of aromatic spices. The rice is partially cooked, then layered with a mixture of sautéed vegetables seasoned with yogurt, cumin, coriander, turmeric, and garam masala. The dish is cooked slowly over low heat, allowing the flavors to meld together and the rice to absorb all the delicious aromas. Garnished with fresh cilantro and mint, Vegetable Biryani is a beloved dish in Indian cuisine, cherished for its comforting taste and vibrant colors."
      },
      {
        "id": 3,
        "name": "Palak Paneer",
        "cuisine": "Indian",
        "photoPath": "../recipes_photo/palak_paneer.jpeg",
        "ingredients": [
          "1 lb paneer, cubed",
          "2 tablespoons ghee or butter",
          "1 onion, finely chopped",
          "2 cloves garlic, minced",
          "1 tablespoon grated fresh ginger",
          "2 green chilies, chopped",
          "1 teaspoon ground cumin",
          "1 teaspoon ground coriander",
          "1/2 teaspoon turmeric",
          "1/4 teaspoon garam masala",
          "1 lb fresh spinach, washed and chopped",
          "1/2 cup heavy cream",
          "Salt to taste"
        ],
        "instructions": [
          "In a skillet, heat ghee or butter over medium heat.",
          "Add onion, garlic, ginger, and green chilies. Sauté until onions are translucent.",
          "Stir in cumin, coriander, turmeric, and garam masala.",
          "Add chopped spinach and cook until wilted.",
          "Transfer mixture to a blender and blend until smooth.",
          "Return mixture to the skillet.",
          "Add paneer cubes and heavy cream. Cook until heated through.",
          "Season with salt to taste.",
          "Serve hot with rice or naan bread."
        ],
        "description": "Palak Paneer is a classic Indian dish made with paneer (Indian cottage cheese) cooked in a creamy spinach sauce. The dish starts with sautéing onions, garlic, ginger, and green chilies in ghee or butter, then adding a blend of aromatic spices including cumin, coriander, turmeric, and garam masala. Fresh spinach is wilted and blended into a smooth sauce, then combined with paneer cubes and heavy cream. The result is a rich and flavorful dish that is both comforting and nutritious, perfect for serving with rice or naan bread."
      },
      {
        "id": 4,
        "name": "Chana Masala",
        "cuisine": "Indian",
        "photoPath": "../recipes_photo/chana_masala.jpeg",
        "ingredients": [
          "2 cups dried chickpeas, soaked overnight and drained",
          "2 tablespoons vegetable oil",
          "1 onion, finely chopped",
          "4 cloves garlic, minced",
          "1 tablespoon grated fresh ginger",
          "2 tomatoes, chopped",
          "1 green chili, chopped",
          "1 teaspoon ground cumin",
          "1 teaspoon ground coriander",
          "1/2 teaspoon turmeric",
          "1/2 teaspoon garam masala",
          "1/4 teaspoon cayenne pepper",
          "Salt to taste",
          "Chopped fresh cilantro for garnish"
        ],
        "instructions": [
          "In a pressure cooker, heat vegetable oil over medium heat.",
          "Add onion, garlic, and ginger. Sauté until onions are translucent.",
          "Stir in tomatoes, green chili, cumin, coriander, turmeric, garam masala, cayenne pepper, and salt.",
          "Add soaked chickpeas and enough water to cover them.",
          "Close the pressure cooker lid and cook for 15-20 minutes, until chickpeas are tender.",
          "Release the pressure and open the lid.",
          "Mash some chickpeas with the back of a spoon to thicken the sauce.",
          "Simmer for a few more minutes, then garnish with chopped cilantro before serving.",
          "Serve hot with rice or naan bread."
        ],
        "description": "Chana Masala is a flavorful Indian dish made with chickpeas cooked in a spiced tomato-based sauce. The dish starts with sautéing onions, garlic, and ginger, then adding tomatoes, green chili, and a blend of aromatic spices including cumin, coriander, turmeric, garam masala, and cayenne pepper. Soaked chickpeas are cooked until tender in a pressure cooker, then simmered in the spiced tomato sauce until the flavors meld together. Garnished with fresh cilantro, Chana Masala is a hearty and satisfying dish that is perfect for vegetarians and meat-lovers alike."
      },
      {
        "id": 5,
        "name": "Aloo Gobi",
        "cuisine": "Indian",
        "photoPath": "../recipes_photo/aloo_gobi.jpeg",
        "ingredients": [
          "2 tablespoons vegetable oil",
          "1 teaspoon cumin seeds",
          "1 onion, finely chopped",
          "2 cloves garlic, minced",
          "1 tablespoon grated fresh ginger",
          "2 tomatoes, chopped",
          "1 teaspoon ground turmeric",
          "1 teaspoon ground coriander",
          "1/2 teaspoon cayenne pepper",
          "1/2 teaspoon garam masala",
          "1 large potato, diced",
          "1 small cauliflower, cut into florets",
          "Salt to taste",
          "Chopped fresh cilantro for garnish"
        ],
        "instructions": [
          "In a skillet, heat vegetable oil over medium heat.",
          "Add cumin seeds and sauté until fragrant.",
          "Add onion, garlic, and ginger. Sauté until onions are translucent.",
          "Stir in tomatoes, turmeric, coriander, cayenne pepper, and garam masala.",
          "Add diced potato and cauliflower florets. Cook until vegetables are tender, stirring occasionally.",
          "Season with salt to taste.",
          "Garnish with chopped cilantro before serving.",
          "Serve hot with rice or naan bread."
        ],
        "description": "Aloo Gobi is a classic Indian dish made with potatoes and cauliflower cooked with aromatic spices. The dish starts with sautéing cumin seeds in vegetable oil, then adding onions, garlic, and ginger. Tomatoes and a blend of spices including turmeric, coriander, cayenne pepper, and garam masala are added to create a flavorful sauce. Diced potatoes and cauliflower florets are simmered in the sauce until tender, then garnished with fresh cilantro. Aloo Gobi is a delicious and comforting dish that pairs well with rice or naan bread."
      },
      {
        "id": 6,
        "name": "Paneer Tikka",
        "cuisine": "Indian",
        "photoPath": "../recipes_photo/paneer_tikka.jpeg",
        "ingredients": [
          "1 lb paneer, cubed",
          "1 bell pepper, diced",
          "1 onion, diced",
          "1/4 cup plain yogurt",
          "1 tablespoon lemon juice",
          "2 teaspoons ground cumin",
          "2 teaspoons ground coriander",
          "1 teaspoon paprika",
          "1/2 teaspoon turmeric",
          "1/2 teaspoon garam masala",
          "1/4 teaspoon cayenne pepper",
          "Salt to taste",
          "Vegetable oil for grilling"
        ],
        "instructions": [
          "In a bowl, combine yogurt, lemon juice, cumin, coriander, paprika, turmeric, garam masala, cayenne pepper, and salt.",
          "Add paneer cubes, bell pepper, and onion. Toss to coat evenly.",
          "Cover and marinate in the refrigerator for at least 1 hour.",
          "Thread paneer cubes, bell pepper, and onion onto skewers.",
          "Preheat grill to medium-high heat.",
          "Brush grill grates with vegetable oil.",
          "Grill paneer skewers for 2-3 minutes per side, until charred and cooked through.",
          "Serve hot with mint chutney or yogurt sauce."
        ],
        "description": "Paneer Tikka is a popular Indian appetizer made with marinated paneer cubes, bell peppers, and onions grilled to perfection. The paneer is marinated in a spiced yogurt mixture flavored with lemon juice, cumin, coriander, paprika, turmeric, garam masala, cayenne pepper, and salt. After marinating, the paneer cubes are threaded onto skewers with bell pepper and onion, then grilled until charred and golden brown. Paneer Tikka is a flavorful and satisfying dish that is perfect for entertaining or as a tasty snack."
      },
      {
        "id": 7,
        "name": "Butter Chicken (Murgh Makhani)",
        "cuisine": "Indian",
        "photoPath": "../recipes_photo/butter_chicken.jpeg",
        "ingredients": [
          "1 lb boneless, skinless chicken thighs, cut into bite-sized pieces",
          "1/4 cup plain yogurt",
          "2 tablespoons lemon juice",
          "1 teaspoon ground cumin",
          "1 teaspoon ground coriander",
          "1/2 teaspoon turmeric",
          "1/2 teaspoon garam masala",
          "1/4 teaspoon cayenne pepper",
          "Salt and pepper to taste",
          "2 tablespoons vegetable oil",
          "1 onion, finely chopped",
          "4 cloves garlic, minced",
          "1 tablespoon grated fresh ginger",
          "1 can (14 oz) crushed tomatoes",
          "1/4 cup heavy cream",
          "2 tablespoons butter",
          "Chopped fresh cilantro for garnish"
        ],
        "instructions": [
          "In a bowl, combine yogurt, lemon juice, cumin, coriander, turmeric, garam masala, cayenne pepper, salt, and pepper.",
          "Add chicken pieces and marinate for at least 1 hour, or overnight for best flavor.",
          "Heat vegetable oil in a skillet over medium heat.",
          "Add onion, garlic, and ginger. Sauté until softened and fragrant.",
          "Stir in crushed tomatoes and cook for 5-7 minutes, until slightly thickened.",
          "Add marinated chicken and cook until browned on all sides and cooked through.",
          "Stir in heavy cream and butter, simmer for 2-3 minutes until heated through.",
          "Garnish with chopped cilantro before serving.",
          "Serve hot with rice or naan bread."
        ],
        "description": "Butter Chicken, also known as Murgh Makhani, is a classic Indian dish featuring tender pieces of chicken marinated in a spiced yogurt mixture, then cooked in a rich and creamy tomato-based sauce. The chicken is marinated in a blend of yogurt, lemon juice, cumin, coriander, turmeric, garam masala, cayenne pepper, salt, and pepper, which infuses it with flavor and tenderness. The sauce is made with onions, garlic, ginger, crushed tomatoes, heavy cream, and butter, creating a velvety texture and indulgent taste. Garnished with fresh cilantro, Butter Chicken is a favorite in Indian cuisine, loved for its comforting flavors and luxurious appeal."
      },
      {
        "id": 8,
        "name": "Samosa",
        "cuisine": "Indian",
        "photoPath": "../recipes_photo/samosa.jpeg",
        "ingredients": [
          "For the dough:",
          "2 cups all-purpose flour",
          "1/2 teaspoon salt",
          "1/4 cup vegetable oil",
          "1/2 cup water",
          "For the filling:",
          "2 potatoes, boiled, peeled, and mashed",
          "1/2 cup green peas",
          "1 onion, finely chopped",
          "2 green chilies, finely chopped",
          "1 teaspoon grated fresh ginger",
          "1 teaspoon ground cumin",
          "1 teaspoon ground coriander",
          "1/2 teaspoon garam masala",
          "1/2 teaspoon turmeric",
          "Salt to taste",
          "Vegetable oil for frying"
        ],
        "instructions": [
          "To make the dough, combine flour and salt in a bowl.",
          "Add vegetable oil and mix until crumbly.",
          "Gradually add water, kneading until a smooth dough forms.",
          "Cover with a damp cloth and let rest for 30 minutes.",
          "To make the filling, combine mashed potatoes, green peas, onion, green chilies, ginger, cumin, coriander, garam masala, turmeric, and salt in a bowl.",
          "Divide the dough into small balls and roll out each ball into a circle.",
          "Cut each circle in half to form semi-circles.",
          "Place a spoonful of filling in the center of each semi-circle.",
          "Fold the dough over the filling to form a triangle and seal the edges.",
          "Heat vegetable oil in a deep fryer or skillet over medium heat.",
          "Fry samosas in batches until golden brown and crispy, about 3-4 minutes per side.",
          "Drain on paper towels before serving.",
          "Serve hot with chutney or sauce."
        ],
        "description": "Samosa is a popular Indian snack made with a crispy pastry shell filled with a savory potato and pea mixture. The dough is made with flour, salt, vegetable oil, and water, then rolled out and filled with a spiced mixture of mashed potatoes, green peas, onion, green chilies, ginger, cumin, coriander, garam masala, turmeric, and salt. The filled pastries are then deep-fried until golden brown and crispy. Samosas are enjoyed as a delicious street food snack or appetizer, often served with chutney or sauce for dipping."
      },
      {
        "id": 9,
        "name": "Chicken Curry",
        "cuisine": "Indian",
        "photoPath": "../recipes_photo/chicken_curry.jpeg",
        "ingredients": [
          "2 tablespoons vegetable oil",
          "1 onion, finely chopped",
          "2 cloves garlic, minced",
          "1 tablespoon grated fresh ginger",
          "2 tomatoes, chopped",
          "1 teaspoon ground cumin",
          "1 teaspoon ground coriander",
          "1/2 teaspoon turmeric",
          "1/2 teaspoon cayenne pepper",
          "1/2 teaspoon garam masala",
          "1 lb boneless, skinless chicken thighs, cut into bite-sized pieces",
          "1/2 cup chicken broth",
          "1/4 cup heavy cream",
          "Salt to taste",
          "Chopped fresh cilantro for garnish"
        ],
        "instructions": [
          "In a skillet, heat vegetable oil over medium heat.",
          "Add onion, garlic, and ginger. Sauté until onions are translucent.",
          "Stir in tomatoes, cumin, coriander, turmeric, cayenne pepper, and garam masala.",
          "Cook until tomatoes are softened and the mixture thickens.",
          "Add chicken pieces and cook until browned on all sides.",
          "Stir in chicken broth and simmer for 15-20 minutes, until chicken is cooked through.",
          "Stir in heavy cream and simmer for an additional 5 minutes.",
          "Season with salt to taste.",
          "Garnish with chopped cilantro before serving.",
          "Serve hot with rice or naan bread."
        ],
        "description": "Chicken Curry is a classic Indian dish featuring tender pieces of chicken cooked in a flavorful tomato-based sauce. The dish starts with sautéing onions, garlic, and ginger, then adding tomatoes and a blend of aromatic spices including cumin, coriander, turmeric, cayenne pepper, and garam masala. Boneless chicken thighs are cooked until tender in the spiced tomato sauce, then simmered in chicken broth and finished with a splash of heavy cream for added richness. Garnished with fresh cilantro, Chicken Curry is a comforting and satisfying meal that is perfect for any occasion."
      },
      {
        "id": 10,
        "name": "Naan Bread",
        "cuisine": "Indian",
        "photoPath": "../recipes_photo/naan_bread.jpeg",
        "ingredients": [
          "2 cups all-purpose flour",
          "1/2 teaspoon baking powder",
          "1/2 teaspoon salt",
          "1/2 cup plain yogurt",
          "1/4 cup milk",
          "1/4 cup water",
          "1 tablespoon vegetable oil",
          "1 tablespoon sugar",
          "Butter or ghee for brushing"
        ],
        "instructions": [
          "In a bowl, combine flour, baking powder, and salt.",
          "In another bowl, whisk together yogurt, milk, water, vegetable oil, and sugar.",
          "Gradually add wet ingredients to dry ingredients, stirring until a soft dough forms.",
          "Knead the dough on a floured surface for 5-7 minutes, until smooth and elastic.",
          "Place dough in a greased bowl, cover with a damp cloth, and let rise in a warm place for 1-2 hours, until doubled in size.",
          "Punch down the dough and divide it into 8 equal portions.",
          "Roll each portion into a ball, then flatten into a disc.",
          "Preheat a skillet or griddle over medium heat.",
          "Cook each naan bread for 2-3 minutes per side, until puffed and golden brown.",
          "Brush with butter or ghee before serving."
        ],
        "description": "Naan Bread is a traditional Indian flatbread that is soft, fluffy, and slightly chewy. Made with simple ingredients including flour, yogurt, milk, and oil, naan bread is easy to prepare and pairs well with a variety of Indian dishes. The dough is mixed together and allowed to rise until doubled in size, then divided into portions and rolled out into discs. The bread is cooked on a hot skillet or griddle until puffed and golden brown, then brushed with butter or ghee for added flavor. Naan bread is a delicious accompaniment to curries, stews, and grilled meats, and is perfect for soaking up flavorful sauces."
      }
    ]
  }
  